cask_args appdir: '/Applications'

tap 'homebrew/cask'
tap 'thoughtbot/formulae'

# stuff
brew 'coreutils'
brew 'imagemagick'
brew 'openssl'
brew 'rcm'
brew 'tree'
brew 'wget'
brew 'httpie'

# git stuff
brew 'git'
brew 'hub'
brew 'gist'
brew 'libgit2'
brew 'git-lfs'
brew 'diff-so-fancy'

# programming languages
brew 'go'
brew 'node'

# databases
brew 'postgresql'

# fish
brew 'fish'
brew 'fasd'

# terminal stuff
brew 'fzf'
brew 'fd'
brew 'bat'
	
# ruby
brew 'ruby-install'
brew 'chruby'
brew 'chruby-fish'

# applications
cask '1password'
cask 'atom'
cask 'docker'
cask 'dropbox'
cask 'flux'
cask 'github-desktop'
cask 'google-chrome'
cask 'iterm2'
cask 'slack'
cask 'spectacle'
cask 'spotify'
cask 'the-unarchiver'
cask 'transmission'
cask 'vlc'
cask 'raycast'
cask 'hyper'
