cask_args appdir: '/Applications'

tap 'homebrew/cask'
tap 'thoughtbot/formulae'

# stuff
brew 'coreutils'
brew 'imagemagick'
brew 'openssl'
brew 'rcm'
brew 'tree'
brew 'wget'
brew 'httpie'
brew 'ag'

# git stuff
brew 'git'
brew 'hub'
brew 'gh'
brew 'gist'
brew 'libgit2'
brew 'git-lfs'
brew 'diff-so-fancy'

# programming languages
brew 'go'

# js
brew 'node'
brew 'yarn'

# databases
brew 'postgresql'

# fish
brew 'fish'
brew 'fasd'
brew 'fisher'

# vim
brew 'neovim'

# terminal stuff
brew 'fzf'
brew 'fd'
brew 'bat'
brew 'jq'
brew 'jump'

# heroku
tap 'heroku/brew'
brew 'heroku'

# ruby
brew 'ruby-install'
brew 'chruby'
brew 'chruby-fish'

# docker
brew 'docker'
cask 'docker'

# applications
cask '1password'
# cask 'atom'
cask 'cron'
cask 'dropbox'
# cask 'flux'
cask 'github'
cask 'google-chrome'
cask 'hush'
cask 'rocket'
cask 'slack'
# cask 'spectacle'
cask 'spotify'
cask 'the-unarchiver'
cask 'transmission'
cask 'tweetbot'
cask 'vlc'
cask 'raycast'
cask 'aerial'

# terminals
# cask 'hyper'
# cask 'iterm2'
cask 'warp'
